avg_score=[]
score=[['学生学号','高等数学','高等物理','高等化学','程序语言','英文6级','本人平均分']
       ,[201,65,58,75,80,80,72]
       ,[202,92,66,85,85,87,83],
        [203,65,68,52,65,85,67]
       ,[204,38,78,98,36,58,62]
       ,[205,56,52,66,98,65,67]
       ,[206,85,66,74,56,85,73]
       ,[207,45,30,58,47,96,55],
        [208,63,88,99,78,56,77],
        [209,54,91,32,85,85,69],
        [210,77,60,85,56,25,61],
        [211,76,56,83,25,35,55],
        [212,75,88,82,98,69,82],
       ['科目平均分',66,67,74,67,69]
       ]

sum1=0
for i in range(1,13):
    for j in range(1,6):
        sum1=sum1+score[i][j]
        if j==5:
            if sum1/5-int(sum1/5)>=0.5:#四舍五入
                sum1=int(sum1/5)+1
            else:
                sum1=int(sum1/5)
            avg_score.append(sum1)
            # avg_score.append(sum1/5)会有小数
            sum1=0
print(avg_score)#平均分数
for t in range(1,13):
    for k in range(1,7):
        if  k==6:
            print(f'学号{score[t][0]},平均成绩{score[t][k]}')





