import numpy as np

courage_avg_score=[]
score=np.array([['学生学号','高等数学','高等物理','高等化学','程序语言','英文6级','本人平均分']
       ,[201,65,58,75,80,80,72]
       ,[202,92,66,85,85,87,83],
        [203,65,68,52,65,85,67]
       ,[204,38,78,98,36,58,62]
       ,[205,56,52,66,98,65,67]
       ,[206,85,66,74,56,85,73]
       ,[207,45,30,58,47,96,55],
        [208,63,88,99,78,56,77],
        [209,54,91,32,85,85,69],
        [210,77,60,85,56,25,61],
        [211,76,56,83,25,35,55],
        [212,75,88,82,98,69,82],
       ['科目平均分',66,67,74,67,69]
       ])
sum1=0
# for j in range(1,6):
#     for i in range(1,13):
#         sum1+=score[i][j]
#         if i==12:
#             if sum1/12-int(sum1/12)>=0.5:
#                 sum1=int(sum1/12)+1
#             else:
#                 sum1=int(sum1/12)
#             courage_avg_score.append(sum1)
#             sum1=0
# print(courage_avg_score)#学科平均分数
# for t in range(1,14):
#     for k in range(1,6):
#         if k>0 and t==13:
#             print(f'{score[0][k]},平均分{score[13][k]}')



